import discord
import urllib.request
import json
import pickle
import datetime
import os

client = discord.Client()
path = "C:/Users/deidra/Desktop/学習用プロジェクト/Py_discord_bot_lyla/.user_info/"
datetime_today = f'{datetime.date.today()}'
weather_list = []
user_info_list =[]


async def weather_message(message):
# 天気予報機能
    if message.content.endswith("の天気予報お願い"):
        city = message.content
        citycodes = {
            "稚内の天気予報お願い": '011000',
            "旭川の天気予報お願い": '012010',
            "留萌の天気予報お願い": '012020',
            "網走の天気予報お願い": '013010',
            "北見の天気予報お願い": '013020',
            "紋別の天気予報お願い": '013030',
            "根室の天気予報お願い": '014010',
            "釧路の天気予報お願い": '014020',
            "帯広の天気予報お願い": '014030',
            "室蘭の天気予報お願い": '015010',
            "浦河の天気予報お願い": '015020',
            "札幌の天気予報お願い": '016010',
            "岩見沢の天気予報お願い": '016020',
            "倶知安の天気予報お願い": '016030',
            "函館の天気予報お願い": '017010',
            "江差の天気予報お願い": '017020',
            "青森の天気予報お願い": '020010',
            "むつの天気予報お願い": '020020',
            "八戸の天気予報お願い": '020030',
            "盛岡の天気予報お願い": '030010',
            "宮古の天気予報お願い": '030020',
            "大船渡の天気予報お願い": '030030',
            "仙台の天気予報お願い": '040010',
            "白石の天気予報お願い": '040020',
            "秋田の天気予報お願い": '050010',
            "横手の天気予報お願い": '050020',
            "山形の天気予報お願い": '060010',
            "米沢の天気予報お願い": '060020',
            "酒田の天気予報お願い": '060030',
            "新庄の天気予報お願い": '060040',
            "福島の天気予報お願い": '070010',
            "小名浜の天気予報お願い": '070020',
            "若松の天気予報お願い": '070030',
            "水戸の天気予報お願い": '080010',
            "土浦の天気予報お願い": '080020',
            "宇都宮の天気予報お願い": '090010',
            "大田原の天気予報お願い": '090020',
            "前橋の天気予報お願い": '100010',
            "みなかみの天気予報お願い": '100020',
            "さいたまの天気予報お願い": '110010',
            "熊谷の天気予報お願い": '110020',
            "秩父の天気予報お願い": '110030',
            "千葉の天気予報お願い": '120010',
            "銚子の天気予報お願い": '120020',
            "館山の天気予報お願い": '120030',
            "東京の天気予報お願い": '130010',
            "大島の天気予報お願い": '130020',
            "八丈島の天気予報お願い": '130030',
            "父島の天気予報お願い": '130040',
            "横浜の天気予報お願い": '140010',
            "小田原の天気予報お願い": '140020',
            "新潟の天気予報お願い": '150010',
            "長岡の天気予報お願い": '150020',
            "高田の天気予報お願い": '150030',
            "相川の天気予報お願い": '150040',
            "富山の天気予報お願い": '160010',
            "伏木の天気予報お願い": '160020',
            "金沢の天気予報お願い": '170010',
            "輪島の天気予報お願い": '170020',
            "福井の天気予報お願い": '180010',
            "敦賀の天気予報お願い": '180020',
            "甲府の天気予報お願い": '190010',
            "河口湖の天気予報お願い": '190020',
            "長野の天気予報お願い": '200010',
            "松本の天気予報お願い": '200020',
            "飯田の天気予報お願い": '200030',
            "岐阜の天気予報お願い": '210010',
            "高山の天気予報お願い": '210020',
            "静岡の天気予報お願い": '220010',
            "網代の天気予報お願い": '220020',
            "三島の天気予報お願い": '220030',
            "浜松の天気予報お願い": '220040',
            "名古屋の天気予報お願い": '230010',
            "豊橋の天気予報お願い": '230020',
            "津の天気予報お願い": '240010',
            "尾鷲の天気予報お願い": '240020',
            "大津の天気予報お願い": '250010',
            "彦根の天気予報お願い": '250020',
            "京都の天気予報お願い": '260010',
            "舞鶴の天気予報お願い": '260020',
            "大阪の天気予報お願い": '270000',
            "神戸の天気予報お願い": '280010',
            "豊岡の天気予報お願い": '280020',
            "奈良の天気予報お願い": '290010',
            "風屋の天気予報お願い": '290020',
            "和歌山の天気予報お願い": '300010',
            "潮岬の天気予報お願い": '300020',
            "鳥取の天気予報お願い": '310010',
            "米子の天気予報お願い": '310020',
            "松江の天気予報お願い": '320010',
            "浜田の天気予報お願い": '320020',
            "西郷の天気予報お願い": '320030',
            "岡山の天気予報お願い": '330010',
            "津山の天気予報お願い": '330020',
            "広島の天気予報お願い": '340010',
            "庄原の天気予報お願い": '340020',
            "下関の天気予報お願い": '350010',
            "山口の天気予報お願い": '350020',
            "柳井の天気予報お願い": '350030',
            "萩の天気予報お願い": '350040',
            "徳島の天気予報お願い": '360010',
            "日和佐の天気予報お願い": '360020',
            "高松の天気予報お願い": '370000',
            "松山の天気予報お願い": '380010',
            "新居浜の天気予報お願い": '380020',
            "宇和島の天気予報お願い": '380030',
            "高知の天気予報お願い": '390010',
            "室戸岬の天気予報お願い": '390020',
            "清水の天気予報お願い": '390030',
            "福岡の天気予報お願い": '400010',
            "八幡の天気予報お願い": '400020',
            "飯塚の天気予報お願い": '400030',
            "久留米の天気予報お願い": '400040',
            "佐賀の天気予報お願い": '410010',
            "伊万里の天気予報お願い": '410020',
            "長崎の天気予報お願い": '420010',
            "佐世保の天気予報お願い": '420020',
            "巌原の天気予報お願い": '420030',
            "福江の天気予報お願い": '420040',
            "熊本の天気予報お願い": '430010',
            "阿蘇乙姫の天気予報お願い": '430020',
            "牛深の天気予報お願い": '430030',
            "人吉の天気予報お願い": '430040',
            "大分の天気予報お願い": '440010',
            "中津の天気予報お願い": '440020',
            "日田の天気予報お願い": '440030',
            "佐伯の天気予報お願い": '440040',
            "宮崎の天気予報お願い": '450010',
            "延岡の天気予報お願い": '450020',
            "都城の天気予報お願い": '450030',
            "高千穂の天気予報お願い": '450040',
            "鹿児島の天気予報お願い": '460010',
            "鹿屋の天気予報お願い": '460020',
            "種子島の天気予報お願い": '460030',
            "名瀬の天気予報お願い": '460040',
            "那覇の天気予報お願い": '471010',
            "名護の天気予報お願い": '471020',
            "久米島の天気予報お願い": '471030',
            "南大東の天気予報お願い": '472000',
            "宮古島の天気予報お願い": '473000',
            "石垣島の天気予報お願い": '474010',
            "与那国島の天気予報お願い": '474020'
        }
        weather = urllib.request.urlopen('https://weather.tsukumijima.net/api/forecast/city/' + citycodes[city]).read()
        weather = json.loads(weather.decode('utf-8'))
        weather_hentou = weather['location']['city']
        weather_hentou += "の天気は、\n"
        for w in weather['forecasts']:
            weather_hentou += w['dateLabel'] + "が" + w['telop'] + "\n"
        weather_hentou += "です。"
        await message.channel.send(weather_hentou)
        user_info_id = f'{message.author.id}'
        text_path = os.path.join(path, user_info_id + "date" + datetime_today + "info.sav")        
        file = open(text_path, "wb")
        user_info_list.append(weather_hentou)
        pickle.dump(user_info_list,file)
        file.close()
        print(user_info_list)